# SetCommonCoverType Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarHostData..::..SetCommonCoverType Method
RebarHostData Class See Also
---
Associate a single CoverType with all exposed faces of the host element.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public void SetCommonCoverType(
	RebarCoverType coverType
)
```

Visual Basic
---
```text
Public Sub SetCommonCoverType ( _
	coverType As RebarCoverType _
)
```

Visual C++
---
```text
public:
void SetCommonCoverType(
	RebarCoverType^ coverType
)
```

# ### Parameters
coverType
    Type: Autodesk.Revit.DB.Structure..::..RebarCoverType A CoverType object to be applied to all faces.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
RebarHostData Class
Autodesk.Revit.DB.Structure Namespace